IRP/src/Catalogs/PLSections/PLSections.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>PLSections</name>
 <hierarchyType>HierarchyOfItems</hierarchyType>
 <attributes>
  <name>SectionType</name>
  <type>
   <types>EnumRef.PLSectionTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>Order</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>3</precision>
   </numberQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>Expression</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>250</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>SectionName</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>20</length>
   </stringQualifiers>
  </type>
 </attributes>
 <tabularSections>
  <name>Accounts</name>
  <attributes>
   <name>Account</name>
   <type>
    <types>ChartOfAccountsRef.Basic</types>
   </type>
  </attributes>
  <attributes>
   <name>TurnoversType</name>
   <type>
    <types>EnumRef.AccountingAnalyticTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionNumber</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>3</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionValue</name>
   <type>
    <types>CatalogRef.ExpenseAndRevenueTypes</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Enums/PLSectionTypes/PLSectionTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>PLSectionTypes</name>
 <enumValues>
  <name>DataSelection</name>
 </enumValues>
 <enumValues>
  <name>Calculation</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Catalogs/PLSections/ObjectModule.bsl
Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	SetSafeMode(True);
	Try
		Execute(ThisObject.SectionName + " = 0");
	Except
		CommonFunctionsClientServer.ShowUsersMessage(R().Error_012, "SectionName", ThisObject);
		Cancel = True;
	EndTry;
	SetSafeMode(False);
	
	If Cancel Then
		Return;
	EndIf;
	
	Query = New Query();
	Query.Text = 
	"SELECT TOP 1
	|	PLSections.Ref
	|FROM
	|	Catalog.PLSections AS PLSections
	|WHERE
	|	NOT PLSections.DeletionMark
	|	AND PLSections.SectionName = &SectionName
	|	AND PLSections.Ref <> &Ref";
	Query.SetParameter("Ref", ThisObject.Ref);
	Query.SetParameter("SectionName", ThisObject.SectionName);
	QueryResult = Query.Execute();
	QuerySelection = QueryResult.Select();
	If QuerySelection.Next() Then
		Message = StrTemplate(R().Error_188, ThisObject.SectionName);
		CommonFunctionsClientServer.ShowUsersMessage(Message, "SectionName", ThisObject);
		Cancel = True;
	EndIf;
	
	If Cancel Then
		Return;
	EndIf;

	For Each Row In ThisObject.Accounts Do
		If ValueIsFilled(Row.ExtDimensionValue) And Not ValueIsFilled(Row.ExtDimensionNumber) Then
			CommonFunctionsClientServer.ShowUsersMessage(R().Error_189, 
					"Object.Accounts[" + (Row.LineNumber - 1) + "].ExtDimensionNumber", 
					"Object.Accounts");
			Cancel = True;
		EndIf;
	EndDo;
EndProcedure

Procedure Filling(FillingData, FillingText, StandardProcessing)
	If FillingData = Undefined Then
		ThisObject.SectionType = Enums.PLSectionTypes.DataSelection;
	EndIf;
EndProcedure
